from matplotlib import rcParams

# 设置中文字体显示
rcParams['font.family'] = 'SimHei'  # 使用黑体
rcParams['axes.unicode_minus'] = False  # 解决负号显示问题

DEFAULT_INSPECT_ITEMS = [
            "车道线悬挂点检测",
            "道路边界交叉检测",
            "车道线交叉检测",
            "停止线交叉检测",
            "车道线前驱后继关系检测",
            "道路边界前驱后继关系检测",
            "地面箭头自相交检测",
            "道路边界自相交检测",
            "人行横道自相交检测",
            "车道面自相交检测",
            "路口面自相交检测",
            "车道线自相交检测",
            "道路面自相交检测",
            "停止线自相交检测",
            "车道线折角检测",
            "道路边界折角检测",
            "道路面挂接车道缺失检测",
            "道路边界与道路面交叉检测",
            "车道左右边线长度差异过大检测",
            "道路面内车道与车道线数量差异过大检测"
        ]